Revit 2027 API
AdvancedMetal.SurfaceRoughness Property
 The property labeled "Roughness" from the "AdvancedMetal" schema.
Namespace: Autodesk.Revit.DB.Visual
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static string SurfaceRoughness { get; }
Public Shared ReadOnly Property SurfaceRoughness As String
	Get
public:
static property String^ SurfaceRoughness {
	String^ get ();
}
static member SurfaceRoughness : string with get
Property Value
String
Remarks
 This property is of type "AssetPropertyDouble". This property allows a connected asset.
See Also
Reference
AdvancedMetal Class
Autodesk.Revit.DB.Visual Namespace